export const notificationList = [
  {
    title: "Объявление 22 марта 2026 (v 1.4.6)",
    content: [
      "В связи с настройкой админки на сайте мог поломаться некоторый функционал (в процессе настройки ролей и прав для этих ролей), поэтому жалуйтесь Соде001, Соде001 пожалуется бэкендеру, бэкендер пойдет всё чинить ヽ(￣ω￣(。。 )ゝ",
    ],
  },
  {
    title: "Обновление 3 октября 2025 (v 1.4.6)",
    content: [
      "• Редактирование названия карты (наконец-то) ⸜( ´ ꒳ ` )⸝",
      "• Авто-добавление @ перед номером карты при создании, если забыли (˘⌣˘)",
      '• Сворачивание раздела "моя коллекция"',
      "• Изменение пароля",
      "• Просмотр вводимого пароля",
      "• Теги стали чутка компактнее",
    ],
  },
  {
    title: "Обновление 6 марта 2025 (v 1.4.5)",
    content: [
      "• Теперь один шаман может добавлять неограниченное количество прохождений! (свершилось |･ω･) ",
      "• Добавлены инновационные баги и божественные тормоза \\( ˙▿˙ )/\\( ˙▿˙ )/",
      "(в случае обнаружение багов и тормозов - пинать соде001)",
    ],
  },
  {
    title: "Обновление 13 февраля 2025 (v 1.4.4)",
    content: [
      "• Окно входа в аккаунт теперь стало... побольше ╮(￣ω￣;)╭",
      "• В окне входа в аккаунт теперь можно узнать, что регистрация доступна только по приглашениям",
    ],
  },
  {
    title: "Обновление 07 февраля 2025 (v 1.4.3)",
    content: [
      "• Добавлены звезды самым активным шаманам ヽ(￣ω￣(。。 )ゝ",
      "• Добавлено отображение процента пройденных карт",
      "• Исправлен баг заголовка полезной инфы",
    ],
  },
  {
    title: "Обновление 07 декабря 2024 (v 1.4.2)",
    content: [
      "• Теперь во вкладке уведомлений можно посмотреть информацию об обновлениях на сайте ⸜( ´ ꒳ ` )⸝",
      "• Добавлена возможность удалять свои комментарии к картам, а также сообщения в чате",
      "• Добавлено подтверждение действия при удалении своего прохождения",
      "• Добавлено скрытие текста, размещенного в чате между ||, под спойлер. ||Пример текста, который будет скрыт||",
    ],
  },
];
